# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-A + C2f_light (ablation experiment: only replace C2f with C2f_light)
# Corresponding to experiment ID: A4

# Parameters
nc: 10  # VisDrone:10, UAVDT:3
scales:
  n: [0.33, 0.25, 1024]  # [depth, width, max_channels]
fusion_mode: concat
node_mode: C2f_Star  # Only change: replace C2f with C2f_Star
head_channel: 256

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, node_mode, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, node_mode, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, node_mode, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, node_mode, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9

# Head (same as yolov8-A.yaml, but uses C2f_light)
head:
  - [4, 1, Conv, [head_channel]]  # 10-P3/8
  - [6, 1, Conv, [head_channel]]  # 11-P4/16
  - [9, 1, Conv, [head_channel]]  # 12-P5/32
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13 P5->P4
  - [[-1, 11], 1, Concat, [1]]  # 14
  - [-1, 3, node_mode, [head_channel]]  # 15-P4/16
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16 P4->P3
  - [[-1, 10], 1, Concat, [1]]  # 17
  - [-1, 3, node_mode, [head_channel]]  # 18-P3/8
  
  - [2, 1, Conv, [head_channel, 3, 2]]  # 19 P2->P3
  - [[-1, 10, 18], 1, Concat, [1]]  # 20
  - [-1, 3, node_mode, [head_channel]]  # 21-P3/8
  
  - [-1, 1, Conv, [head_channel, 3, 2]]  # 22 P3->P4
  - [[-1, 11, 15], 1, Concat, [1]]  # 23
  - [-1, 3, node_mode, [head_channel]]  # 24-P4/16
  
  - [-1, 1, Conv, [head_channel, 3, 2]]  # 25 P4->P5
  - [[-1, 12], 1, Concat, [1]]  # 26
  - [-1, 3, node_mode, [head_channel]]  # 27-P5/32
  
  - [[21, 24, 27], 1, Detect, [nc]]  # Detect(P3, P4, P5)